tap "hashicorp/tap"
tap "jakehilborn/jakehilborn"
brew "ast-grep"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "blackbox"
brew "coreutils"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gitui"
brew "go"
brew "go@1.21"
brew "golangci-lint"
brew "harfbuzz"
brew "graphviz"
brew "jq"
brew "lazygit"
brew "librdkafka"
brew "mockery"
brew "mysql"
brew "neovim"
brew "openjdk"
brew "pcsc-lite"
brew "pkgconf"
brew "ripgrep"
brew "terraform"
brew "tmux"
brew "uv"
brew "wget"
brew "yarn"
brew "yq"
brew "hashicorp/tap/boundary"
brew "hashicorp/tap/vault"
brew "jakehilborn/jakehilborn/displayplacer"
cask "docker-desktop"
cask "ghostty"
cask "google-drive"
cask "linear-linear"
cask "ngrok"
cask "notion"
cask "postman"
