tap "hashicorp/tap"
tap "jakehilborn/jakehilborn"
brew "ast-grep"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "blackbox"
brew "coreutils"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gitui"
brew "go"
brew "go@1.21"
brew "golangci-lint"
brew "harfbuzz"
brew "graphviz"
brew "jq"
brew "lazygit"
brew "librdkafka"
brew "mockery"
brew "mysql"
brew "neovim"
brew "openjdk"
brew "pcsc-lite"
brew "pkgconf"
brew "ripgrep"
brew "terraform"
brew "tmux"
brew "uv"
brew "wget"
brew "yarn"
brew "yq"
brew "hashicorp/tap/boundary"
brew "hashicorp/tap/vault"
brew "jakehilborn/jakehilborn/displayplacer"
cask "docker-desktop"
cask "ghostty"
cask "google-drive"
cask "linear-linear"
cask "ngrok"
cask "notion"
cask "postman"
go "github.com/moovfinancial/bumper/cmd/bump"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/DeusData/codebase-memory-mcp/cmd/codebase-memory-mcp"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "olexsmir.xyz/json2go/cmd/json2go"
go "github.com/vektra/mockery/v2"
go "go.uber.org/mock/mockgen"
go "github.com/moovfinancial/nullscan"
go "github.com/markbates/pkger/cmd/pkger"
go "github.com/kyoh86/richgo"
go "github.com/adamdecaf/xmlencoderclose"
